Maps = {
    ["中原"] = MainMap,
    ["东方"] = EastMap,
    ["西方"] = WestMap,
    ["少林"] = ShaolinMap,
    ["灵鹫宫"] = LingJiuGongMap,
    ["姑苏慕容"] = MuRongMap,
}

RoomAreas = {
    ["小山坡"] = "西方",
    ["青海草原-eu-w"] = "西方",
    ["青海草原-n-s-e-w-nw"] = "西方",
    ["山脚-se-ne-nu"] = "西方",
    ["山脚-n-e-w-su"] = "西方",
    ["谷场"] = "西方",


    ["虎跳溪"] = "西方",
    ["灵鹫宫宫门"] = "西方",

    ["松树林-s-e-w-nu"] = "西方",
    ["走道"] = "西方",
    ["一品堂"] = "西方",
    ["点将台"] = "西方",
    ["演武场"] = "西方",
    ["一品堂大厅"] = "西方",
    ["林中空地"] = "西方",
    ["青草坪"] = "西方",
    ["小木屋"] = "西方",
    ["小客栈"] = "西方",

    --
    ["都灵子卧室"] = "东方",
    ["「三清观」大殿"] = "东方",
    ["前庭"] = "东方",
    ["小院-s-n-w"] = "东方",
    ["帐房"] = "东方",
    ["药房"] = "东方",
    ["「三清观」大门"] = "东方",
    ["海边小道-n-s-e-w"] = "东方",
    ["不醉无归小客栈"] = "东方",
    ["蓬莱岛码头"] = "东方",

    ["黄土大道-开封-泰山-蓬莱-se-w"] = "东方",
    ["黄土大道-n-ne-w"] = "东方",

    -- 泰岳
    ["甬道"] = "东方",
    ["神憩小舍"] = "东方",
    ["天贶殿"] = "东方",

    --

    ["少室山山脚"] = "少林",
    ["山间土屋"] = "少林",
    ["石井"] = "少林",
    ["一苇亭"] = "少林",
    ["法如塔"] = "少林",
    ["孟钵峰顶"] = "少林",
    ["二祖庵庵门"] = "少林",
    ["大殿-s-e-w"] = "少林",
    ["卓锡泉"] = "少林",
    ["山门"] = "少林",

    ["大雄宝殿"] = "少林",
    ["广场中央"] = "少林",
    ["练武场"] = "少林",
    ["法堂"] = "少林",
    ["菩提院"] = "少林",

    ["禅房"] = "少林",
    ["回廊-s-n-e-w"] = "少林",
    ["回廊-s-n-e"] = "少林",
    ["地藏殿"] = "少林",
    ["方丈精舍"] = "少林",

    ["林间小径-e-ne-su"] = "少林",
    ["山道-se-sw-nu"] = "少林",

    ["灵鹫宫药铺"] = "灵鹫宫",
    ["大厅"] = "灵鹫宫",
    ["小院-s-n-e-w"] = "灵鹫宫",
    ["东厢房"] = "灵鹫宫",
    ["东客房"] = "灵鹫宫",

    ["渔人码头"] = "姑苏慕容",
    ["荷花荡中-se-ne"] = "姑苏慕容",
    ["小岛边"] = "姑苏慕容",
    ["燕龙客栈"] = "姑苏慕容",
    ["望燕亭"] = "姑苏慕容",
    ["听雨居"] = "姑苏慕容",
    ["长廊-n-s-e-w"] = "姑苏慕容",
    ["边门"] = "姑苏慕容",
}
