Hotels = {
    ["天龙客栈"] = {
        ["房间"] = { "u;;s", "u;;n", "u;;e", "u;;ne", "u;;se", "u;;w", "u;;sw", "u;;nw" },
        ["npc"] = "waiter",
        ["bank"] = "大理钱庄",
    },
    ["古城客栈"] = {
        ["房间"] = { "u;;e", "u;;s;;w", "u;;s;;e;;s", "u;;w;;n" },
        ["npc"] = "keeper",
        ["bank"] = "洛阳钱庄",
    },
    ["登封客栈"] = {
        ["房间"] = { "u;;n", "u;;w", "u;;e" },
        ["npc"] = "waiter",
        ["bank"] = "登封钱庄",
    },
    ["龙门客栈"] = {
        ["房间"] = { "u;;nw", "u;;n", "u;;ne", "u;;w", "u;;e", "u;;sw", "u;;s", "u;;se" },
        ["npc"] = "waiter",
        ["bank"] = "富贵钱庄",
    },
    ["禅房"] = {
        ["房间"] = { "e", "se", "ne", "sw", "nw" },
        ["npc"] = "qingzheng",
        ["bank"] = "登封钱庄",
    },
    -- 天山客栈
    ["东客房"] = {
        ["房间"] = { "s", "eu", "e", "wu", "se", "w", "sw", "su" },
        ["npc"] = "xiao cui",
        ["bank"] = "",
    },
    -- 逍遥子客栈
    ["小客栈"] = {
        ["房间"] = { "u;;s", "u;;n", "u;;e", "u;;w" },
        ["npc"] = "waiter",
        ["bank"] = "洛阳钱庄",
    },
    ["不醉无归小客栈"] = {
        ["房间"] = { "u;;e", "u;;w", "u;;n", "u;;s" },
        ["npc"] = "waiter",
        ["bank"] = "帐房",
    }
}
