MainMap = {}

-- 新手区
MainMap["欢迎来到天龙八部"] = {}
MainMap["食物屋"] = {}


-- 汴梁
MainMap["汴梁城中心"] = {}
MainMap["东安门"] = {}
MainMap["镇西门"] = {}
MainMap["龙门客栈"] = {}
MainMap["富贵钱庄"] = {}
MainMap["聚宝门"] = {}
MainMap["五龙场"] = {}
MainMap["金刀镖局"] = {}
MainMap["金刀镖局大院"] = {}
MainMap["城隍庙"] = {
    ["汴梁东大街-5"] = { "1n", 1 }
}

MainMap["沈记杂货铺"] = {
    ["汴梁南大街-3"] = { "1s2w", 3 }
}

MainMap["汴梁南大街-3"] = {
    ["沈记杂货铺"] = { "2e1n", 3 },
}


-- 洛阳
MainMap["洛阳中心"] = {}

MainMap["洛阳东街1"] = {}
MainMap["洛阳东门"] = {}

MainMap["洛阳南街2"] = {
    ["洛阳中心"] = { "2n", 2 },
    ["洛阳南街3"] = { "1s", 1 },
    ["粮店"] = { "1e", 1 },
}

MainMap["洛阳南街3"] = {
    ["洛阳南街2"] = { "1n", 1 },
    ["洛阳南街4"] = { "1s", 1 },
}

MainMap["洛阳南街4"] = {
    ["洛阳南街3"] = { "1n", 1 },
    ["大路-s-n-se"] = { "2s", 2 },
}

MainMap["洛阳西街1"] = {}
MainMap["洛阳西街2"] = {}
MainMap["洛阳西街3"] = {}
MainMap["洛阳西街4"] = {}

MainMap["洛阳北街1"] = {}

MainMap["洛阳西门"] = {}
MainMap["天水关"] = {}
MainMap["古城客栈"] = {}
MainMap["粮店"] = {}
MainMap["洛阳钱庄"] = {}

MainMap["松鹤楼"] = {}
MainMap["松鹤楼二楼"] = {}

MainMap["大路-s-n-se"] = {
    ["洛阳南街4"] = { "2n", 2 },
    ["大道-n-s-ne"] = { "1s1e1s4w2n", 9 },
}

MainMap["大道-n-s-ne"] = {
    ["大路-s-n-se"] = { "2s4e1n1w1n", 9 },
    ["马山"] = { "2n1nw1nu", 4 },
}

MainMap["马山"] = {
    ["大道-n-s-ne"] = { "1sd1se2s", 4 },
    ["鼋头渚"] = { "1wd1ne1n1ne", 4 },
}

MainMap["鼋头渚"] = {
    ["马山"] = { "1sw1s1sw1se", 4 },
    ["太湖边-nw"] = { "1se", 1 }
}

MainMap["太湖边-nw"] = {
    ["鼋头渚"] = { "1nw", 1 },
}


-- 大理
MainMap["十字广场"] = {
    ["大理北街１"] = { "1n", 1 },
    ["大理南街２"] = { "2s", 2 },
}
MainMap["大理北街１"] = {
    ["驿站"] = { "1e", 1 },
    ["大理北街３"] = { "2n", 2 },
    ["十字广场"] = { "1s", 1 },
}
MainMap["驿站"] = {
    ["大理北街１"] = { "1w", 1 },
}

MainMap["大理北街３"] = {
    ["大理北街１"] = { "2s", 2 },
    ["大理北街４"] = { "1n", 1 },
}

MainMap["大理北街４"] = {
    ["大理北街３"] = { "1s", 1 },
    ["黄土大道-开封-大理-n-w-sw"] = { "5n1ne", 6 },
}
MainMap["大理东街２"] = {}
MainMap["大理南街２"] = {}
MainMap["大理南街４"] = {}
MainMap["大理西街１"] = {}
MainMap["大理西街３"] = {}
MainMap["精武镖局"] = {
    ["库房-n"] = { "1e1s", 2 },
}
MainMap["库房-n"] = {
    ["精武镖局"] = { "1n1w", 2 }
}
MainMap["大理钱庄"] = {}
MainMap["天龙客栈"] = {}
MainMap["段家当铺"] = {}
MainMap["中药店"] = {}


-- 皇宫
MainMap["皇宫大门"] = {}
MainMap["清和宫"] = {}
MainMap["大殿-皇宫-wd-sd-nd-ed"] = {}

MainMap["杂货铺"] = {}
MainMap["戏院"] = {}

MainMap["江边小路"] = {}
MainMap["善人渡"] = {}


-- 登封
MainMap["登封县中央广场"] = {}
MainMap["登封县东街"] = {}
MainMap["登封县东郊"] = {}
MainMap["登封县北街"] = {}
MainMap["登封县西街一"] = {}
MainMap["登封客栈"] = {}
MainMap["登封钱庄"] = {}


-- 秦家寨
MainMap["山坳"] = {}
MainMap["寨门"] = {}
MainMap["广场"] = {}


-- auxilious room. doesn't exist
MainMap["汴梁东大街-3"] = {}
MainMap["汴梁东大街-5"] = {}

MainMap["汴梁南大街-1"] = {}


MainMap["汴梁南大街-5"] = {}
MainMap["汴梁西大街-3"] = {}
MainMap["库房-金刀镖局-w"] = {
    ["金刀镖局大院"] = { "1w", 1 },
}

MainMap["黄土大道-开封-大理-n-w-sw"] = {}
MainMap["黄土大道-开封-洛阳-登封-s-e-w"] = {}


-- Edges

MainMap["欢迎来到天龙八部"]["龙门客栈"] = { "1d", 1 }
MainMap["欢迎来到天龙八部"]["食物屋"] = { "5s", 5 }
MainMap["食物屋"]["龙门客栈"] = { "6s1d", 7 }


MainMap["汴梁城中心"]["汴梁西大街-3"] = { "3w", 3 }
MainMap["汴梁西大街-3"]["汴梁城中心"] = { "3e", 3 }

MainMap["汴梁西大街-3"]["镇西门"] = { "3w", 3 }
MainMap["镇西门"]["汴梁西大街-3"] = { "3e", 3 }

MainMap["汴梁西大街-3"]["五龙场"] = { "3n", 3 }
MainMap["五龙场"]["汴梁西大街-3"] = { "3s", 3 }

MainMap["五龙场"]["金刀镖局"] = { "1e1n", 2 }
MainMap["金刀镖局"]["五龙场"] = { "1s1w", 2 }

MainMap["金刀镖局"]["金刀镖局大院"] = { "1n", 1 }
MainMap["金刀镖局大院"]["金刀镖局"] = { "1s", 1 }
MainMap["金刀镖局大院"]["库房-金刀镖局-w"] = { "1e", 1 }

MainMap["汴梁城中心"]["汴梁东大街-3"] = { "3e", 3 }
MainMap["汴梁东大街-3"]["汴梁城中心"] = { "3w", 3 }

MainMap["汴梁东大街-3"]["汴梁东大街-5"] = { "2e", 2 }
MainMap["汴梁东大街-5"]["汴梁东大街-3"] = { "2w", 2 }

MainMap["汴梁东大街-5"]["东安门"] = { "1e", 1 }
MainMap["东安门"]["汴梁东大街-5"] = { "1w", 1 }



MainMap["汴梁城中心"]["汴梁南大街-1"] = { "1s", 1 }
MainMap["汴梁南大街-1"]["汴梁城中心"] = { "1n", 1 }

MainMap["汴梁南大街-1"]["富贵钱庄"] = { "1w", 1 }
MainMap["富贵钱庄"]["汴梁南大街-1"] = { "1e", 1 }

MainMap["汴梁南大街-5"]["聚宝门"] = { "1s", 1 }
MainMap["聚宝门"]["汴梁南大街-5"] = { "1n", 1 }

MainMap["汴梁南大街-1"]["汴梁南大街-3"] = { "2s", 2 }
MainMap["汴梁南大街-3"]["汴梁南大街-1"] = { "2n", 2 }

MainMap["汴梁南大街-3"]["汴梁南大街-5"] = { "2s", 2 }
MainMap["汴梁南大街-5"]["汴梁南大街-3"] = { "2n", 2 }

MainMap["龙门客栈"]["汴梁南大街-5"] = { "1w", 1 }
MainMap["汴梁南大街-5"]["龙门客栈"] = { "1e", 1 }

MainMap["聚宝门"]["黄土大道-开封-大理-n-w-sw"] = { "3s", 3 }
MainMap["黄土大道-开封-大理-n-w-sw"]["聚宝门"] = { "3n", 3 }

MainMap["黄土大道-开封-大理-n-w-sw"]["江边小路"] = { "1sw1s1w", 3 }
MainMap["江边小路"]["黄土大道-开封-大理-n-w-sw"] = { "1e1n1ne", 3 }

MainMap["江边小路"]["聚宝门"] = { "1e1n1ne3n", 6 }
MainMap["聚宝门"]["江边小路"] = { "3s1sw1s1w", 6 }

MainMap["江边小路"]["善人渡"] = { "1nd1w", 2 }
MainMap["善人渡"]["江边小路"] = { "1e1su", 2 }


--  大理
MainMap["黄土大道-开封-大理-n-w-sw"]["大理北街４"] = { "1sw5s", 6 }

MainMap["大理南街２"]["十字广场"] = { "2n", 2 }

MainMap["大理南街２"]["中药店"] = { "1e", 1 }
MainMap["中药店"]["大理南街２"] = { "1w", 1 }

MainMap["大理南街２"]["大理南街４"] = { "2s", 2 }
MainMap["大理南街４"]["大理南街２"] = { "2n", 2 }

MainMap["大理南街４"]["精武镖局"] = { "1e", 1 }
MainMap["精武镖局"]["大理南街４"] = { "1w", 1 }

MainMap["十字广场"]["大理东街２"] = { "2e", 2 }
MainMap["大理东街２"]["十字广场"] = { "2w", 2 }

MainMap["大理东街２"]["大理钱庄"] = { "1n", 1 }
MainMap["大理钱庄"]["大理东街２"] = { "1s", 1 }

MainMap["大理东街２"]["天龙客栈"] = { "1s", 1 }
MainMap["天龙客栈"]["大理东街２"] = { "1n", 1 }

MainMap["十字广场"]["大理西街１"] = { "1w", 1 }
MainMap["大理西街１"]["十字广场"] = { "1e", 1 }

MainMap["段家当铺"]["大理西街１"] = { "1n", 1 }
MainMap["大理西街１"]["段家当铺"] = { "1s", 1 }

MainMap["大理西街１"]["大理西街３"] = { "2w", 2 }
MainMap["大理西街３"]["大理西街１"] = { "2e", 2 }

MainMap["大理西街１"]["戏院"] = { "1n", 1 }
MainMap["戏院"]["大理西街１"] = { "1s", 1 }

MainMap["杂货铺"]["大理西街３"] = { "1n", 1 }
MainMap["大理西街３"]["杂货铺"] = { "1s", 1 }

-- 大理皇宫

MainMap["大理北街１"]["皇宫大门"] = { "3w2n", 5 }
MainMap["皇宫大门"]["大理北街１"] = { "2s3e", 5 }

MainMap["皇宫大门"]["清和宫"] = { "3n1nu", 4 }
MainMap["清和宫"]["皇宫大门"] = { "1sd3s", 4 }

MainMap["大殿-皇宫-wd-sd-nd-ed"]["清和宫"] = { "2sd2su", 4 }
MainMap["清和宫"]["大殿-皇宫-wd-sd-nd-ed"] = { "2nd2nu", 4 }

-- 洛阳地区

MainMap["洛阳东街1"]["洛阳中心"] = { "1w", 1 }
MainMap["洛阳中心"]["洛阳东街1"] = { "1e", 1 }

MainMap["洛阳东街1"]["洛阳钱庄"] = { "1s", 1 }
MainMap["洛阳钱庄"]["洛阳东街1"] = { "1n", 1 }

MainMap["洛阳东街1"]["古城客栈"] = { "1n", 1 }
MainMap["古城客栈"]["洛阳东街1"] = { "1s", 1 }

MainMap["洛阳东门"]["洛阳东街1"] = { "4w", 4 }
MainMap["洛阳东街1"]["洛阳东门"] = { "4e", 4 }


MainMap["洛阳中心"]["洛阳南街2"] = { "2s", 2 }

MainMap["粮店"]["洛阳南街2"] = { "1w", 1 }

MainMap["洛阳中心"]["洛阳西街1"] = { "1w", 1 }
MainMap["洛阳西街1"]["洛阳中心"] = { "1e", 1 }

MainMap["洛阳西街1"]["洛阳西街2"] = { "1w", 1 }
MainMap["洛阳西街2"]["洛阳西街1"] = { "1e", 1 }

MainMap["洛阳西街2"]["洛阳西街3"] = { "1w", 1 }
MainMap["洛阳西街3"]["洛阳西街2"] = { "1e", 1 }

MainMap["洛阳西街3"]["洛阳西街4"] = { "1w", 1 }
MainMap["洛阳西街4"]["洛阳西街3"] = { "1e", 1 }

MainMap["洛阳西街4"]["洛阳西门"] = { "1w", 1 }
MainMap["洛阳西门"]["洛阳西街4"] = { "1e", 1 }

MainMap["洛阳西门"]["天水关"] = { "3w", 3 }
MainMap["天水关"]["洛阳西门"] = { "3e", 3 }

MainMap["洛阳中心"]["洛阳北街1"] = { "1n", 1 }
MainMap["洛阳北街1"]["洛阳中心"] = { "1s", 1 }

MainMap["洛阳中心"]["洛阳北街1"] = { "1n", 1 }
MainMap["洛阳北街1"]["洛阳中心"] = { "1s", 1 }

MainMap["洛阳北街1"]["松鹤楼"] = { "1w", 1 }
MainMap["松鹤楼"]["洛阳北街1"] = { "1e", 1 }

MainMap["松鹤楼"]["松鹤楼二楼"] = { "1u", 1 }
MainMap["松鹤楼二楼"]["松鹤楼"] = { "1d", 1 }


--  登封县

MainMap["登封县中央广场"]["黄土大道-开封-大理-n-w-sw"] = { "6e", 6 }
MainMap["黄土大道-开封-大理-n-w-sw"]["登封县中央广场"] = { "6w", 6 }

MainMap["登封县中央广场"]["登封县东街"] = { "1e", 1 }
MainMap["登封县东街"]["登封县中央广场"] = { "1w", 1 }

MainMap["登封县东街"]["登封县东郊"] = { "1e", 1 }
MainMap["登封县东郊"]["登封县东街"] = { "1w", 1 }

MainMap["登封县中央广场"]["登封县北街"] = { "1n", 1 }
MainMap["登封县北街"]["登封县中央广场"] = { "1s", 1 }

MainMap["登封县北街"]["登封客栈"] = { "1e", 1 }
MainMap["登封客栈"]["登封县北街"] = { "1w", 1 }

MainMap["登封县中央广场"]["登封县西街一"] = { "1w", 1 }
MainMap["登封县西街一"]["登封县中央广场"] = { "1e", 1 }

MainMap["登封县西街一"]["登封钱庄"] = { "1n", 1 }
MainMap["登封钱庄"]["登封县西街一"] = { "1s", 1 }


-- 秦家寨
MainMap["天水关"]["山坳"] = { "1n1w1wu1nw", 4 }
MainMap["山坳"]["天水关"] = { "1se1ed1e1s", 4 }

MainMap["山坳"]["寨门"] = { "1pushaside bush2n1e1n2e1n1e3n", 12 }
MainMap["寨门"]["山坳"] = { "3s1w1s1e", 6 }

MainMap["寨门"]["广场"] = { "2n", 2 }
MainMap["广场"]["寨门"] = { "2s", 2 }


-- auxilious nodes
MainMap["黄土大道-开封-洛阳-登封-s-e-w"]["镇西门"] = { "3e", 3 }
MainMap["镇西门"]["黄土大道-开封-洛阳-登封-s-e-w"] = { "3w", 3 }
MainMap["黄土大道-开封-洛阳-登封-s-e-w"]["洛阳东门"] = { "2w", 2 }
MainMap["洛阳东门"]["黄土大道-开封-洛阳-登封-s-e-w"] = { "2e", 2 }
MainMap["黄土大道-开封-洛阳-登封-s-e-w"]["登封县北街"] = { "2s", 2 }
MainMap["登封县北街"]["黄土大道-开封-洛阳-登封-s-e-w"] = { "2n", 2 }


-- 东方
EastMap = {
    -- 蓬莱
    ["都灵子卧室"] = {
        ["「三清观」大殿"] = { "2w1s1e", 4 },
    },
    ["「三清观」大殿"] = {
        ["前庭"] = { "2s", 2 },
        ["都灵子卧室"] = { "1w1n2e", 4 },
    },
    ["前庭"] = {
        ["「三清观」大门"] = { "2s", 2 },
        ["「三清观」大殿"] = { "2n", 2 },
        ["小院-s-n-w"] = { "2e", 2 },
    },
    ["小院-s-n-w"] = {
        ["前庭"] = { "2w", 2 },
        ["帐房"] = { "1n", 1 },
        ["药房"] = { "1s", 1 },
    },
    ["帐房"] = {
        ["小院-s-n-w"] = { "1s", 1 },
    },
    ["药房"] = {
        ["小院-s-n-w"] = { "1n", 1 },
    },
    ["「三清观」大门"] = {
        ["海边小道-n-s-e-w"] = { "2s", 2 },
        ["前庭"] = { "2n", 2 },
    },
    ["海边小道-n-s-e-w"] = {
        ["蓬莱岛码头"] = { "1s", 1 },
        ["不醉无归小客栈"] = { "1w", 1 },
        ["「三清观」大门"] = { "2n", 2 },
    },
    ["不醉无归小客栈"] = {
        ["海边小道-n-s-e-w"] = { "1e", 1 },
    },
    ["蓬莱岛码头"] = {
        ["海边小道-n-s-e-w"] = { "1n", 1 },
        ["黄土大道-开封-泰山-蓬莱-se-w"] = { "1w2sw1w1nw", 5 }
    },
    ["黄土大道-开封-泰山-蓬莱-se-w"] = {
        ["黄土大道-n-ne-w"] = { "1se1e", 2 },
    },
    ["黄土大道-n-ne-w"] = {
        ["黄土大道-开封-泰山-蓬莱-se-w"] = { "1w1nw", 2 },
        ["蓬莱岛码头"] = { "2ne1e", 3 },
        ["天贶殿"] = { "9n", 9 },
    },
    ["天贶殿"] = {
        ["黄土大道-开封-泰山-蓬莱-se-w"] = { "9s", 9 },
        ["甬道"] = { "1w1n", 2 },
        ["神憩小舍"] = { "3n2nw2nu1n1nu1n1nu1n1nu1ne1nu", 15 },
    },
    ["甬道"] = {
        ["天贶殿"] = { "1s1e", 2 },
    },
    ["神憩小舍"] = {
        ["天贶殿"] = { "1sd1se1sd1s1sd1s1sd1s2sd2se3s", 15 },
    }
}


--  西域
WestMap = {}

-- 天山
WestMap["小山坡"] = {}
WestMap["青海草原-eu-w"] = {}
WestMap["青海草原-n-s-e-w-nw"] = {}

WestMap["虎跳溪"] = {}
WestMap["灵鹫宫宫门"] = {}


-- 一品堂
WestMap["松树林-s-e-w-nu"] = {}
WestMap["走道-n-s-e-w"] = {}
WestMap["一品堂"] = {}
WestMap["点将台"] = {}
WestMap["演武场"] = {}
WestMap["一品堂大厅"] = {}


-- 天山
WestMap["小山坡"]["青海草原-eu-w"] = { "1wd", 1 }
WestMap["青海草原-eu-w"]["小山坡"] = { "1eu", 1 }

WestMap["小山坡"]["松树林-s-e-w-nu"] = { "1sd", 1 }
WestMap["松树林-s-e-w-nu"]["小山坡"] = { "1nu", 1 }

WestMap["松树林-s-e-w-nu"]["一品堂"] = { "1s", 1 }
WestMap["一品堂"]["松树林-s-e-w-nu"] = { "1n", 1 }

WestMap["一品堂"]["走道-n-s-e-w"] = { "1s", 1 }
WestMap["走道-n-s-e-w"]["一品堂"] = { "1n", 1 }

WestMap["走道-n-s-e-w"]["演武场"] = { "1e1s", 2 }
WestMap["演武场"]["走道-n-s-e-w"] = { "1n1w", 2 }

WestMap["走道-n-s-e-w"]["点将台"] = { "1w1s", 2 }
WestMap["点将台"]["走道-n-s-e-w"] = { "1n1e", 2 }

WestMap["走道-n-s-e-w"]["一品堂大厅"] = { "1s", 1 }
WestMap["一品堂大厅"]["走道-n-s-e-w"] = { "1n", 1 }

WestMap["青海草原-eu-w"]["青海草原-n-s-e-w-nw"] = { "2w", 2 }
WestMap["青海草原-n-s-e-w-nw"]["青海草原-eu-w"] = { "2e", 2 }

WestMap["青海草原-n-s-e-w-nw"]["山脚-se-ne-nu"] = { "1nw", 1 }

WestMap["虎跳溪"]["山脚-se-ne-nu"] = { "2nu", 2 }

WestMap["山脚-se-ne-nu"] = {
    ["青海草原-n-s-e-w-nw"] = { "1se", 1 },
    ["山脚-n-e-w-su"] = { "1ne1nu4nd", 6 },
    ["虎跳溪"] = { "2nu", 2 }
}

WestMap["山脚-n-e-w-su"] = {
    ["山脚-se-ne-nu"] = { "4su1sd1sw", 6 },
    ["谷场"] = { "2n", 2 },
    ["林中空地"] = { "3w1nw1sw", 5 },
}

WestMap["谷场"] = {
    ["山脚-n-e-w-su"] = { "2s", 2 }
}

WestMap["林中空地"] = {
    ["山脚-n-e-w-su"] = { "1ne1se3e", 5 },
    ["青草坪"] = { "1nw1sw3e1s2w", 8 },
}

WestMap["青草坪"] = {
    ["林中空地"] = { "3e1n1w1ne1se", 7 },
    ["小木屋"] = { "2n", 2 },
    ["小客栈"] = { "3w", 3 },
}

WestMap["小木屋"] = {
    ["青草坪"] = { "2s", 2 },
}

WestMap["小客栈"] = {
    ["青草坪"] = { "3e", 3 },
}

-- WestMap["灵鹫宫宫门"]["虎跳溪"] = { "6s2sd1wu1sd", 10 }

-- 少林

ShaolinMap = {}
ShaolinMap["少室山山脚"] = {}
ShaolinMap["山间土屋"] = {}
ShaolinMap["石井"] = {}
ShaolinMap["一苇亭"] = {}
ShaolinMap["法如塔"] = {}
ShaolinMap["孟钵峰顶"] = {}
ShaolinMap["二祖庵庵门"] = {}

ShaolinMap["林间小径-e-ne-su"] = {}
ShaolinMap["山道-se-sw-nu"] = {}

-- ShaolinMap[""] = {}
-- ShaolinMap[""] = {}
-- ShaolinMap[""] = {}
-- ShaolinMap[""] = {}
-- ShaolinMap[""] = {}
-- ShaolinMap[""] = {}
-- ShaolinMap[""] = {}
-- ShaolinMap[""] = {}
-- ShaolinMap[""] = {}
-- ShaolinMap[""] = {}
-- ShaolinMap[""] = {}

ShaolinMap["山门"] = {
    ["广场中央"] = { "2n", 2 },
    ["山道-se-sw-nu"] = { "2sd", 2 },
}

ShaolinMap["广场中央"] = {
    ["山门"] = { "2s", 2 },
    ["大雄宝殿"] = { "1n2nu2n2nu", 7 },
}

ShaolinMap["大雄宝殿"] = {
    ["广场中央"] = { "2sd2s2sd1s", 7 },
    ["练武场"] = { "1n", 1 },
}

ShaolinMap["练武场"] = {
    ["大雄宝殿"] = { "1s", 1 },
    ["法堂"] = { "1n", 1 },
}

ShaolinMap["法堂"] = {
    ["练武场"] = { "1s", 1 },
    ["禅房"] = { "1e", 1 }
}

ShaolinMap["禅房"] = {
    ["法堂"] = { "1w", 1 },
    ["回廊-s-n-e-w"] = { "1n", 1 },
}

ShaolinMap["回廊-s-n-e-w"] = {
    ["禅房"] = { "1s", 1 },
    ["回廊-s-n-e"] = { "1n", 1 },
    ["地藏殿"] = { "1w", 1 },
}

ShaolinMap["回廊-s-n-e"] = {
    ["菩提院"] = { "1e1n", 2 },
    ["回廊-s-n-e-w"] = { "1s", 1 },
}

ShaolinMap["地藏殿"] = {
    ["方丈精舍"] = { "2s1open door1s", 4 },
    ["回廊-s-n-e-w"] = { "1e", 1 },
}

ShaolinMap["方丈精舍"] = {
    ["地藏殿"] = { "1open door3n", 4 }
}

ShaolinMap["菩提院"] = {
    ["回廊-s-n-e"] = { "1s1w", 2 },
}

ShaolinMap["少室山山脚"]["山间土屋"] = { "1nw1nu", 2 }
ShaolinMap["山间土屋"]["少室山山脚"] = { "1sd1se", 2 }

ShaolinMap["山间土屋"]["石井"] = { "1e", 1 }
ShaolinMap["石井"]["山间土屋"] = { "1e", 1 }

ShaolinMap["山间土屋"]["一苇亭"] = { "1n1eu", 2 }
ShaolinMap["一苇亭"]["山间土屋"] = { "1wd1s", 2 }

ShaolinMap["一苇亭"]["山道-se-sw-nu"] = { "1n1nw", 2 }
ShaolinMap["山道-se-sw-nu"]["一苇亭"] = { "1se1s", 2 }

ShaolinMap["山道-se-sw-nu"]["林间小径-e-ne-su"] = { "1sw1wu1su1sw", 4 }
ShaolinMap["林间小径-e-ne-su"]["山道-se-sw-nu"] = { "1ne1nd1ed1ne", 4 }

ShaolinMap["山道-se-sw-nu"]["山门"] = { "2nu", 2 }

ShaolinMap["林间小径-e-ne-su"]["法如塔"] = { "1e", 1 }
ShaolinMap["法如塔"]["林间小径-e-ne-su"] = { "1w", 1 }

ShaolinMap["林间小径-e-ne-su"]["孟钵峰顶"] = { "1su", 1 }
ShaolinMap["孟钵峰顶"]["林间小径-e-ne-su"] = { "1nd", 1 }

ShaolinMap["孟钵峰顶"]["二祖庵庵门"] = { "1w", 1 }
ShaolinMap["二祖庵庵门"]["孟钵峰顶"] = { "1e", 1 }

ShaolinMap["二祖庵庵门"]["卓锡泉"] = { "1open door1n", 2 }

ShaolinMap["大殿-s-e-w"] = {
    ["卓锡泉"] = { "1s", 1 },
}

ShaolinMap["卓锡泉"] = {
    ["二祖庵庵门"] = { "1open door1s", 2 },
    ["大殿-s-e-w"] = { "1open door1n", 2 }
}


LingJiuGongMap = {
    ["灵鹫宫药铺"] = {
        ["大厅"] = { "1e", 1 }
    },
    ["大厅"] = {
        ["灵鹫宫药铺"] = { "1w", 1 },
        ["小院-s-n-e-w"] = { "1s", 1 },
    },
    ["小院-s-n-e-w"] = {
        ["大厅"] = { "1n", 1 },
        ["东厢房"] = { "1e", 1 },
    },
    ["东厢房"] = {
        ["小院-s-n-e-w"] = { "1w", 1 },
        ["东客房"] = { "1s", 1 },
    },
    ["东客房"] = {
        ["东厢房"] = { "1n", 1 },
    },
}

MuRongMap = {
    ["渔人码头"] = {
        ["荷花荡中-se-ne"] = { "5e1eu1ed2n1e1w1s1n1e", 14, },
    },
    ["荷花荡中-se-ne"] = {
        ["小岛边"] = { "1ne1e", 2, },
        ["渔人码头"] = { "1se1w3s1wu1wd5w", 12, },
    },
    ["小岛边"] = {
        ["燕龙客栈"] = { "1n", 1, },
        ["望燕亭"] = { "1e", 1 },
        ["荷花荡中-se-ne"] = { "1w1sw", 2 },
    },
    ["燕龙客栈"] = {
        ["小岛边"] = { "1s", 1, },
    },
    ["望燕亭"] = {
        ["小岛边"] = { "1w", 1, },
        ["长廊-n-s-e-w"] = { "2n", 2 },
    },
    ["边门"] = {
        ["长廊-n-s-e-w"] = { "1s3e", 4 },
    },
    ["长廊-n-s-e-w"] = {
        ["边门"] = { "3w1n", 4 },
        ["望燕亭"] = { "2s", 2 },
    },
}
